package aladdin.pcsc;

///////////////////////////////////////////////////////////////////////////////
// Состояние считывателя
///////////////////////////////////////////////////////////////////////////////
public class ReaderStatus {
    public String[] readers;        // имена считывателей
    public int      state;          // состояние считывателя/смарт-карты
    public int      protocol;       // используемый протокол
    public byte[]   atr;            // ATR вставленной карты
}
