package aladdin.pcsc;

///////////////////////////////////////////////////////////////////////////
// Состояние считывателя
///////////////////////////////////////////////////////////////////////////
public enum ReaderState 
{ 
    UNKNOWN    (0), // неизвестное имя считывателя
    UNAVAILABLE(1), // неизвестное состояние считывателя
    EMPTY      (2), // отсутствует смарт-карта в считывателе
    CARD       (3); // присутствует смарт-карта в считывателе
        
    // конструктор
    private ReaderState(int value) { intValue = value; } 
    
    // получить значение
    public int value() { return intValue; } private final int intValue;
}; 
