Repository: fwdaa/SCCAPI
Catalog: Source/Aladdin.CAPI.GUI/BioPinEnrollDialog.*.resx
Languages: ru

# checkRightThumb.Text
source: thumb
ru: большой

# checkRightMiddle.Text
source: middle
ru: средний

# checkRightIndex.Text
source: index
ru: указательный

# checkRightLittle.Text
source: little
ru: мизинец

# checkRightRing.Text
source: ring
ru: безымянный

# groupRight.Text
source: Right Hand
ru: Правая рука

# checkLeftIndex.Text
source: thumb
ru: большой

# checkLeftThumb.Text
source: index
ru: указательный

# checkLeftMiddle.Text
source: middle
ru: средний

# checkLeftRing.Text
source: ring
ru: безымянный

# checkLeftLittle.Text
source: little
ru: мизинец

# groupLeft.Text
source: Left Hand
ru: Левая рука

# buttonCancel.Text
source: Cancel
ru: Отмена

# buttonOK.Text
source: Enroll
ru: Регистрация

# labelReader.Text
source: Scaner:
ru: Сканер:

# groupSelect.Text
source: Processed swipes
ru: Выполненные отпечатки

# labelFinger.Text
source: Current swipe:
ru: Текущий отпечаток:

# comboFinger.Items
source: Left little
ru: Левый мизинец

# comboFinger.Items1
source: Left ring
ru: Левый безымянный

# comboFinger.Items2
source: Left middle
ru: Левый средний

# comboFinger.Items3
source: Left index
ru: Левый указательный

# comboFinger.Items4
source: Left thumb
ru: Левый большой

# comboFinger.Items5
source: Right little
ru: Правый мизинец

# comboFinger.Items6
source: Right ring
ru: Правый безымянный

# comboFinger.Items7
source: Right middle
ru: Правый средний

# comboFinger.Items8
source: Right index
ru: Правый указательный

# comboFinger.Items9
source: Right thumb
ru: Правый большой

# labelQuality.Text
source: Available Quality:
ru: Допустимое качество:

# buttonStop.Text
source: Stop
ru: Стоп

# buttonStart.Text
source: Start
ru: Старт

# groupScan.Text
source: Scanning
ru: Сканирование

# labelPIN.Text
source: PIN:
ru: PIN-код:

# labelPIN2.Text
source: Confirmation:
ru: Подтвержедние:

# labelType.Text
source: Role:
ru: Роль:

# $this.Text
source: Biometric and PIN Authentication Data
ru: Данные биометрической и PIN-аутентификации
