Repository: fwdaa/SCCAPI
Catalog: Source/Aladdin.CAPI.GUI/Resource.*.resx
Languages: ru

# ErrorSubjectName
source: Invalid Subject Name
ru: Некорректное имя субъекта

# ErrorPathLength
source: Invalid Path Length
ru: Некорректное значение глубины

# FilterCertificateFile
source: X.509 Files (*.cer)|*.cer
ru: X.509-файлы (*.cer)|*.cer

# FilterRequestFile
source: PKCS10 Files (*.p10)|*.p10
ru: PKCS10-файлы (*.p10)|*.p10

# MenuManageDirectories
source: Manage container directories...
ru: Управление каталогами контейнеров...

# MenuSetCertificate
source: Set certificate...
ru: Установить сертификат...

# MenuCreateCertificate
source: Create selfsigned certificate...
ru: Создать самоподписанный сертификат...

# MenuCreateRequest
source: Create certificate request...
ru: Создать запрос на сертификат...

# MenuDeleteKeyPair
source: Delete key pair
ru: Удалить ключевую пару

# MenuDeleteContainer
source: Delete container
ru: Удалить контейнер

# MenuViewCertificates
source: View container certificates
ru: Показать сертификаты контейнера

# MenuGenerateKeyPair
source: Generate container key pair...
ru: Создать ключевую пару в контейнере...

# MenuProperties
source: Properties
ru: Свойства

# MenuShowContainer
source: Show container
ru: Показать контейнер

# QuestionDeleteObjects
source: Do you really want to delete selected object(s)?
ru: Вы действительно хотите удалить выбранный объект(ы)?

# StatusSetCertificate
source: The certificate is successfully set
ru: Сертификат успешно установлен

# StatusDeleteKeyPairs
source: The key pair(s) is successfully deleted
ru: Ключ(и) успешно удален(ы)

# StatusDeleteContainers
source: The container(s) is successfully deleted
ru: Контейнер(ы) успешно удален(ы)

# StatusGeneratePair
source: The key pair is successfully generated
ru: Ключевая пара успешно сгенерирована

# StatusSaveRequestFile
source: The certificate request is successfully save to file
ru: Запрос на сертификат успешно сохранен в файл

# TitleDialogDirectory
source: Select container directory:
ru: Выберите каталог контейнера:

# TitleOpenCertificateFile
source: Select certificate file
ru: Укажите файл с сертификатом

# TitleSaveRequestFile
source: Select file for certificate request
ru: Укажите файл для запроса на сертификат

# CommonName
source: Crypto API Administration Console
ru: Консоль администрирования Крипто API

# StatusChangeDirectories
source: The container directories are successfully changed
ru: Каталоги контейнеров успешно изменены

# StatusImportPair
source: The key pair is successfully imported
ru: Ключевая пара успешно импортирована

# MenuImportKeyPair
source: Import container key pair...
ru: Импортировать ключевую пару в контейнер...

# MenuChangeLanguage
source: Change language for display...
ru: Изменить отображаемый язык...

# MessageFingerEnrollNoVerified
source: The finger template is not verified
ru: Шаблон отпечатка пальца не прошёл проверку

# MessageFingerCaptured
source: Finger template is done. Leave finger out of scaner
ru: Шаблон отпечатка изготовлен. Поднимите палец от сканера

# MessageFingerRepeat
source: Finger template is done. Leave finger out of scaner and then touch finger again to scanner for verification
ru: Шаблон отпечатка изготовлен. Поднимите палец от сканера и приложите его заново для проверки

# MessageFingerTouch
source: Touch finger to scanner
ru: Приложите палец к сканеру для снятия отпечатка

# MessageFingerEnrollVerified
source: The finger template is verified
ru: Шаблон отпечатка пальца прошёл проверку

# MessageFingerVerifyCompleted
source: The finger templates are successfully verified
ru: Шаблоны отпечатков успешно проверены

# ErrorPublicKeyMismatch
source: The certificate public key is not the container public key
ru: Открытый ключ сертификата не соответствует открытому ключу контейнера

# ErrorPasswordMismatch
source: The entered passwords mismatch
ru: Введенные пароли не совпадают

# MenuChangeLogin
source: Change authentication data...
ru: Изменить аутентификационные данные...

# MessageChangeLogin
source: Authentication data is successfully changed
ru: Аутентификационные данные успешно изменены

# NodeCardTypes
source: Card Types
ru: Типы смарт-карт

# NodeProviders
source: Providers
ru: Провайдеры

# NodeReaders
source: Readers
ru: Считыватели

# MessageFingerQuality
source: The finger capture image has low quality
ru: Полученный отпечаток пальца имеет плохое качество
