#include "..\stdafx.h"
#include "MAC_GOST28147.h"

///////////////////////////////////////////////////////////////////////////////
// Дополнительные определения трассировки
///////////////////////////////////////////////////////////////////////////////
#ifdef WPP_CONTROL_GUIDS
#include "MAC_GOST28147.tmh"
#endif 

///////////////////////////////////////////////////////////////////////////
// Алгоритм вычисления имитовставки ГОСТ 28147-89
///////////////////////////////////////////////////////////////////////////
void Aladdin::CAPI::CSP::Tumar::MAC::GOST28147::SetParameters(CAPI::CSP::KeyHandle^ hKey) 
{$
    // вызвать базовую функцию
    CAPI::CSP::Mac::SetParameters(hKey); 

	// установить таблицу подстановок и режим смены ключа
	hKey->SetString(KP_CIPHEROID, sboxOID, 0); hKey->SetLong(KP_MESHING, 0, 0);
}
