Repository: fwdaa/SCCAPI
Catalog: Source/Aladdin.CAPI.STB.GUI/STB34101Control.*.resx
Languages: ru

# TitleLabel.Text
source: Database
ru: База данных

# radioSTB34101_CTR_256.Text
source: STB 34.101-CTR (256)
ru: СТБ 34.101-CTR (256)

# radioSTB34101_CFB_256.Text
source: STB 34.101-CFB (256)
ru: СТБ 34.101-CFB (256)

# radioSTB34101_CTR_192.Text
source: STB 34.101-CTR (192)
ru: СТБ 34.101-CTR (192)

# radioSTB34101_CFB_192.Text
source: STB 34.101-CFB (192)
ru: СТБ 34.101-CFB (192)

# radioSTB34101_CBC_192.Text
source: STB 34.101-CBC (192)
ru: СТБ 34.101-CBC (192)

# radioSTB34101_CTR_128.Text
source: STB 34.101-CTR (128)
ru: СТБ 34.101-CTR (128)

# radioSTB34101_CFB_128.Text
source: STB 34.101-CFB (128)
ru: СТБ 34.101-CFB (128)

# radioSTB34101_CBC_128.Text
source: STB 34.101-CBC (128)
ru: СТБ 34.101-CBC (128)

# groupBoxPBES2Cipher.Text
source: Encryption Scheme
ru: Схема шифрования

# labelIterationsPBE.Text
source: Iterations:
ru: Число итераций:

# labelSaltLengthPBE.Text
source: Salt Length:
ru: Размер "соли":

# labelIterationsPBMAC.Text
source: Iterations:
ru: Число итераций:

# labelSaltLengthPBMAC.Text
source: Salt Length:
ru: Размер "соли":

# groupBoxHash.Text
source: Hash
ru: Хэш
