///////////////////////////////////////////////////////////////////////////
// Именованные параметры ГОСТ Р34.10
///////////////////////////////////////////////////////////////////////////
namespace Aladdin.CAPI.GOST.GOSTR3410
{
    public interface INamedParameters : CAPI.IParameters
    {
        string ParamOID { get; }	// параметры эллиптических кривых
        string HashOID  { get; }	// параметры алгоритма хэширования
        string SBoxOID  { get; }	// идентификатор таблицы подстановок
    }
}