#include "..\stdafx.h"
#include "GOSTR3411_1994.h"

///////////////////////////////////////////////////////////////////////////////
// Дополнительные определения трассировки
///////////////////////////////////////////////////////////////////////////////
#ifdef WPP_CONTROL_GUIDS
#include "GOSTR3411_1994.tmh"
#endif 

///////////////////////////////////////////////////////////////////////////
// Алгоритм хэширования ГОСТ Р 34.11-1994
///////////////////////////////////////////////////////////////////////////
Aladdin::CAPI::CSP::HashHandle^ Aladdin::CAPI::GOST::CSP::CryptoPro::Hash::GOSTR3411_1994::Construct()
{$
	// создать алгоритм хэширования
	Using<CAPI::CSP::HashHandle^> hHash(CAPI::CSP::Hash::Construct()); 

	// установить идентификатор параметров
	hHash.Get()->SetString(HP_OID, paramsOID, 0); return hHash.Detach();
}
