using System;

namespace Aladdin.PCSC
{
    ///////////////////////////////////////////////////////////////////////////
    // Состояние смарт-карты
    ///////////////////////////////////////////////////////////////////////////
    [Flags] public enum CardState { 
        Empty       = 0x0, // отсутствует в считывателе
        Present     = 0x1, // присутствует в считывателе
        Mute        = 0x3, // заблокированная карта
        Exclusive   = 0x5, // монопольный доступ другого процесса
        Shared      = 0x9  // разделяемый доступ с другими процессами
    }; 
}
