Repository: fwdaa/SCCAPI
Catalog: Source/Aladdin.CAPI.GOST.GUI/CultureControl.*.resx
Languages: ru

# TitleLabel.Text
source: Database
ru: База данных

# groupBoxPBES2Cipher.Text
source: Encryption Scheme
ru: Схема шифрования

# radioKuznyechik.Text
source: GOSTR34.12-CTR-ACPKM(128)
ru: ГОСТР34.12-CTR-ACPKM(128)

# radioMagma.Text
source: GOSTR34.12-CTR-ACPKM(64)
ru: ГОСТР34.12-CTR-ACPKM(64)

# radioGOST28147_C.Text
source: GOST28147-C
ru: ГОСТ28147-C

# radioGOST28147_B.Text
source: GOST28147-B
ru: ГОСТ28147-B

# radioGOST28147_D.Text
source: GOST28147-D
ru: ГОСТ28147-D

# radioGOST28147_A.Text
source: GOST28147-A
ru: ГОСТ28147-A

# labelIterationsPBE.Text
source: Iterations:
ru: Число итераций:

# radioPBKDF2_HMAC_GOSTR3411_2012_256.Text
source: HMAC-GOSTR34.11-2012(256)
ru: HMAC-ГОСТP34.11-2012(256)

# radioPBKDF2_HMAC_GOSTR3411_2012_512.Text
source: HMAC-GOSTR34.11-2012(512)
ru: HMAC-ГОСТP34.11-2012(512)

# radioPBKDF2_HMAC_GOSTR3411_1994.Text
source: HMAC-GOSTR34.11-1994
ru: HMAC-ГОСТP34.11-1994

# labelSaltLengthPBE.Text
source: Salt Length:
ru: Размер "соли":

# labelIterationsPBMAC.Text
source: Iterations:
ru: Число итераций:

# labelSaltLengthPBMAC.Text
source: Salt Length:
ru: Размер "соли":

# groupBoxHash.Text
source: Hash
ru: Хэш

# radioGOSTR3411_2012_256.Text
source: GOSTR34.11-2012(256)
ru: ГОСТP34.11-2012(256)

# radioGOSTR3411_2012_512.Text
source: GOSTR34.11-2012(512)
ru: ГОСТP34.11-2012(512)

# radioGOSTR3411_1994.Text
source: GOSTR34.11-1994
ru: ГОСТP34.11-1994
