using System;

namespace Aladdin.ASN1
{
	///////////////////////////////////////////////////////////////////////////
	// Закодированное BER-представление объекта
	///////////////////////////////////////////////////////////////////////////
	public interface IEncodable : IEquatable<IEncodable>
	{
		Tag    Tag		{ get; }	// тип объекта
		PC     PC       { get; }	// способ кодирования
		byte[] Content  { get; }	// содержимое объекта
		byte[] Encoded  { get; }	// закодированное представление 
	}
}
