namespace Aladdin.CAPI.Bio
{
    ///////////////////////////////////////////////////////////////////////////
    // Палец для аутентификации
    ///////////////////////////////////////////////////////////////////////////
    public enum Finger { 
        None        = 0x0, // отсутствие значения
        LeftLittle  = 0x1, // мизинец левой руки
        LeftRing    = 0x2, // безымянный палец левой руки
        LeftMiddle  = 0x3, // средний палец левой руки
        LeftIndex   = 0x4, // указательный палец левой руки
        LeftThumb   = 0x5, // большой палец левой руки
        RightLittle = 0x6, // мизинец правой руки
        RightRing   = 0x7, // безымянный палец правой руки
        RightMiddle = 0x8, // средний палец правой руки
        RightIndex  = 0x9, // указательный палец правой руки
        RightThumb  = 0xA, // большой палец правой руки
    }; 
}
