namespace Aladdin.Math 
{
    ////////////////////////////////////////////////////////////////////////////
    // Интерфейс мультипливативной группы
    ////////////////////////////////////////////////////////////////////////////
    public interface IGroupMul<E> 
    {
        // признак единичного элемента
        bool IsOne(E a); E One { get; }
    
        // обратный и возведенный в квадрат элемент
        E Invert(E a); E Sqr(E a);
    
        // умножение и деление элементов
        E Product(E a, E b); E Divide(E a, E b);
    
        // возведение в степень элемента
        E Power(E a, BigInteger e); 
        
        // произведение возведенных в степень элементов
        E PowerProduct(E P, BigInteger a, E Q, BigInteger b); 
    }
}
